PL/SQL Developer Test script 3.0
50
-- Created on 29.01.2018 by V.ZHURAVOV 
declare 
  -- Local variables here
  i integer;
begin
  -- Test statements here
  f2ndfl_load_empl_api.load_xml(
    p_code_na => 1,
    p_year    => 2016,
    p_xml     => xmltype('<?xml version="1.0" encoding="windows-1251"?>
<Файл xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ИдФайл="NO_NDFL2_7726_7726_7736149919772601001_20170125_74c7444b-991c-4c83-b3f0-90d86d1ad125" ВерсПрог="1С:ЗУП 2.5" ВерсФорм="5.04">
  <СвРекв ОКТМО="45920000" ОтчетГод="2016" ПризнакФ="1">
    <СвЮЛ ИННЮЛ="7736149919" КПП="772601001"/>
  </СвРекв>
  <Документ КНД="1151078" ДатаДок="25.01.2017" НомСпр="1" ОтчетГод="2016" Признак="1" НомКорр="00" КодНО="7726">
    <Подписант ПрПодп="1">
      <ФИО Фамилия="Потехина" Имя="Валентина" Отчество="Васильевна"/>
    </Подписант>
    <СвНА ОКТМО="45920000" Тлф="(495) 721-83-83">
      <СвНАЮЛ НаимОрг="НПФ &quot;ГАЗФОНД&quot;" ИННЮЛ="7736149919" КПП="772601001"/>
    </СвНА>
    <ПолучДох ИННФЛ="132810642241" Статус="1" ДатаРожд="22.03.1982" Гражд="643">
      <ФИО Фамилия="Абрамова" Имя="Ольга" Отчество="Александровна"/>
      <УдЛичнФЛ КодУдЛичн="21" СерНомДок="45 15 037395"/>
      <АдрМЖРФ Индекс="125476" КодРегион="77" Улица="Окружная ул" Дом="2а" Кварт="10"/>
    </ПолучДох>
    <СведДох Ставка="13">
      <ДохВыч>
        <СвСумДох Месяц="01" КодДоход="2760" СумДоход="17312.50">
          <СвСумВыч КодВычет="503" СумВычет="4000.00"/>
        </СвСумДох>
        <СвСумДох Месяц="02" КодДоход="2760" СумДоход="17312.50"/>
        <СвСумДох Месяц="03" КодДоход="2000" СумДоход="65750.00"/>
        <СвСумДох Месяц="03" КодДоход="2760" СумДоход="17312.50"/>
        <СвСумДох Месяц="04" КодДоход="2760" СумДоход="17312.50"/>
        <СвСумДох Месяц="05" КодДоход="2760" СумДоход="17312.50"/>
        <СвСумДох Месяц="06" КодДоход="2760" СумДоход="17312.50"/>
        <СвСумДох Месяц="07" КодДоход="2760" СумДоход="17312.50"/>
        <СвСумДох Месяц="08" КодДоход="2760" СумДоход="17312.50"/>
        <СвСумДох Месяц="09" КодДоход="2760" СумДоход="17312.50"/>
        <СвСумДох Месяц="10" КодДоход="2760" СумДоход="17312.50"/>
        <СвСумДох Месяц="11" КодДоход="2760" СумДоход="17312.50"/>
        <СвСумДох Месяц="12" КодДоход="2760" СумДоход="17312.50"/>
      </ДохВыч>
      <СумИтНалПер СумДохОбщ="273500.00" НалБаза="269500.00" НалИсчисл="35035" АвансПлатФикс="0" НалУдерж="35035" НалПеречисл="35035" НалУдержЛиш="0" НалНеУдерж="0"/>
    </СведДох>
  </Документ>
</Файл>')
  );
end;
0
0
